UoS-EEC/fused/mcu/msp430fr5xx/Msp430Cpu.cpp
/*
 * Copyright (c) 2019-2020, University of Southampton and Contributors.
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <spdlog/spdlog.h>
#include <stdint.h>

#include <chrono>
#include <iomanip>
#include <iostream>
#include <map>
#include <string>
#include <systemc>
#include <thread>
#include <tlm>

#include "mcu/msp430fr5xx/Msp430Cpu.hpp"
#include "ps/EventLog.hpp"
#include "utilities/Config.hpp"
#include "utilities/Utilities.hpp"

extern "C" {
#include "mcu/msp430fr5xx/device_includes/msp430fr5994.h"
}

using namespace sc_core;

Msp430Cpu::Msp430Cpu(const sc_module_name name, const bool logOperation,
                     const bool logInstructions)
    : sc_module(name),
      m_doLogOperation(logOperation),
      m_doLogInstructions(logInstructions),
      m_elog(EventLog::getInstance()) {
  iSocket.bind(*this);

  SC_THREAD(process);

  m_idleCyclesEvent =
      m_elog.registerEvent(std::string(this->name()) + " idle cycles");

  std::string ops[] = {"ADD", "ADDC", "AND",  "BIC",  "BIS",  "BIT",  "CALL",
                       "CMP", "DADD", "JC",   "JZ",   "JGE",  "JL",   "JMP",
                       "JN",  "JNC",  "JNZ",  "MOV",  "PUSH", "RETI", "RRA",
                       "RRC", "SUB",  "SUBC", "SWPB", "SXT",  "XOR"};

  for (const auto &op : ops) {
    instrEventIds[op] = m_elog.registerEvent(std::string("inst-") + op);
  }

  m_formatIEvent = m_elog.registerEvent(std::string(this->name()) + " formatI");
  m_formatIIEvent =
      m_elog.registerEvent(std::string(this->name()) + " formatII");
  m_formatIIIEvent =
      m_elog.registerEvent(std::string(this->name()) + " formatIII");
  m_pcIsDestinationEvent =
      m_elog.registerEvent(std::string(this->name()) + " pc-is-dest");
  m_irqEvent = m_elog.registerEvent(std::string(this->name()) + " irq");

  std::string odir = Config::get().getString("OutputDirectory");
  if (logOperation) {
    m_opsLogFile.open(odir + "/cpu_op.log");
  }

  if (logInstructions) {
    m_instrLogFile.open(odir + "/cpu_instructions.log");
  }
}

void Msp430Cpu::reset(void) {
  for (auto &r : m_cpuRegs) {
    r = 0;
  }
  setSr(CPUOFF);  // Don't execute anything until we get the power-up NMI
}

void Msp430Cpu::process() {
  wait(SC_ZERO_TIME);  // Wait for start of simulation

  while (true) {  // Run emulator

    if (pwrOn.read() && m_run) {
      // Handle interrupts
      if (irq.read()) {
        EventLog::getInstance().increment(m_irqEvent);
        processInterrupt();
      }

      // Handle breakpoints
      if (m_breakpoints.count(getPc()) > 0) {  // Hit breakpoint
        std::cout << "@" << std::setw(10) << sc_core::sc_time_stamp()
                  << ": Breakpoint hit (0x" << std::hex << getPc() << ")!\n";
        m_run = false;
        continue;
      }

      if (getSr() & CPUOFF) {
        // Low-power mode -- don't execute instructions
        if (!m_sleeping) {
          EventLog::getInstance().reportState(this->name(), "sleep");
          m_sleeping = true;
        }
        wait(mclk->getPeriod());
      } else {
        // Normal mode -- execute instructions
        if (m_sleeping) {
          EventLog::getInstance().reportState(this->name(), "on");
          m_sleeping = false;
        }
        uint16_t opcode = fetch();
        static const uint16_t INST_RETI = 0x1300;
        if (m_doLogOperation && opcode == INST_RETI) {
          m_opsLogFile << "@" << sc_time_stamp() << ": RETI\n";
        }

        uint8_t instructionFmt = (opcode & 0xe000) >> 13;
        if (instructionFmt == 0) {
          executeSingleOpInstruction(opcode);
          m_elog.increment(m_formatIIEvent);
        } else if (instructionFmt == 1) {
          executeConditionalJump(opcode);
          m_elog.increment(m_formatIIIEvent);
        } else {
          executeDoubleOpInstruction(opcode);
          m_elog.increment(m_formatIEvent);
        }
        if (m_doStep) {  // end single step
          m_run = false;
          m_doStep = false;
        }
      }
    }

    if (!m_run) {
      waitForCommand();  // Stall simulation, waiting for gdb server interaction
    }

    if (m_run && (!pwrOn.read())) {
      EventLog::getInstance().reportState(this->name(), "off");
      wait(pwrOn.posedge_event());  // Wait for power
      m_sleeping = false;
      reset();  // Reset
    }
  }
}

void Msp430Cpu::processInterrupt() {
  uint16_t addr;

  if (irqIdx.read() == 0) {  // Reset vector (BOR/PUC)
    addr = 0xfffe;

    // Acknowledge interrupt source
    ira.write(true);
    waitCycles(2);
    ira.write(false);

    // Clear all bits of SR except SCG0
    setSr(getSr() & (1u << 6));

    // Load reset vector
    setPc(read16(addr));

    if (m_doLogOperation) {
      using namespace std;
      m_opsLogFile << "@" << setw(10) << sc_time_stamp() << ": IRQHANDLER 0x"
                   << hex << setw(4) << addr << "\n";
    }
    EventLog::getInstance().reportState(this->name(), "on");
    m_sleeping = false;
  } else if ((getSr() & GIE) || irqIdx.read() < 3) {  // GIE or NMI
    // Push pc to stack
    setSp(getSp() - 2);
    write16(getSp(), getPc());

    // Push SR to stack
    setSp(getSp() - 2);
    write16(getSp(), getSr());

    // Capture interrupt vector address
    addr = 0xfffe - (2 * irqIdx.read());

    // IRQ flag (source) resets if the selected peripheral's IRA is
    // connected
    ira.write(true);
    wait(2 * mclk->getPeriod());
    ira.write(false);

    // Clear all bits of SR except SCG0
    setSr(getSr() & (1u << 6));

    // Load content of interrupt vector to PC
    setPc(read16(addr));

    if (m_doLogOperation) {
      using namespace std;
      m_opsLogFile << "@" << setw(10) << sc_time_stamp() << ": IRQHANDLER 0x"
                   << hex << setw(4) << addr << "\n";
    }
  } else {
    // Do nothing -- interrupts are disabled, and this was not an NMI
    return;
  }
}

void Msp430Cpu::writeMem(const uint32_t addr, uint8_t *const data,
                         const size_t bytelen) {
  sc_time delay;
  tlm::tlm_generic_payload trans;

