UoS-EEC/fused/mcu/msp430fr5xx/Msp430Cpu.cpp
  if (busStall.read()) {
    wait(busStall.negedge_event());
  }

  delay = SC_ZERO_TIME;
  trans.set_address(addr);
  trans.set_data_length(bytelen);
  trans.set_data_ptr(data);
  trans.set_command(tlm::TLM_WRITE_COMMAND);
  iSocket->b_transport(trans, delay);

  if (trans.get_response_status() != tlm::TLM_OK_RESPONSE) {
    spdlog::error("{} Failed write to address 0x{:08x}.", this->name(), addr);
    sc_stop();
  }
  wait(delay);
}

void Msp430Cpu::readMem(const uint32_t addr, uint8_t *const data,
                        const size_t bytelen) {
  sc_time delay;
  tlm::tlm_generic_payload trans;

  if (busStall.read()) {
    wait(busStall.negedge_event());
  }

  delay = SC_ZERO_TIME;
  trans.set_address(addr);
  trans.set_data_length(bytelen);
  trans.set_data_ptr(data);
  trans.set_command(tlm::TLM_READ_COMMAND);
  iSocket->b_transport(trans, delay);

  if (trans.get_response_status() != tlm::TLM_OK_RESPONSE) {
    spdlog::error("{} Failed read from address 0x{:08x}.", this->name(), addr);
    sc_stop();
  }

  wait(delay);
}

void Msp430Cpu::dbg_writeReg(uint16_t addr, uint16_t val) {
  assert(addr <= N_GPR);
  switch (addr) {
    case PC_REGNUM:
      setPc(val);
      break;
    case SP_REGNUM:
      setSp(val);
      break;
    case SR_REGNUM:
      setSr(val);
      break;
    case CG_REGNUM:
      // Special purpose constant generator register.
      SC_REPORT_FATAL(this->name(), "Attempt to write to r3 (constant gen");
      break;
    default:
      setGpr(addr, val);
      break;
  }
}

uint16_t Msp430Cpu::dbg_readReg(unsigned addr) {
  uint16_t result = 0;
  assert(addr <= N_GPR);
  switch (addr) {
    case PC_REGNUM:
      result = getPc();
      break;
    case SP_REGNUM:
      result = getSp();
      break;
    case SR_REGNUM:
      result = getSr();
      break;
    case CG_REGNUM:
      result = 0;  // Special case: Constant generator, return 0
      break;
    default:
      result = getGpr(addr);
      break;
  }

  return result;
}

void Msp430Cpu::insertBreakpoint(unsigned addr) { m_breakpoints.insert(addr); }

void Msp430Cpu::removeBreakpoint(unsigned addr) { m_breakpoints.erase(addr); }

void Msp430Cpu::step(void) {
  m_doStep = true;
  m_run = true;
}

void Msp430Cpu::stall(void) { m_run = false; }

void Msp430Cpu::unstall(void) { m_run = true; }

bool Msp430Cpu::isStalled(void) { return !m_run; }

uint16_t Msp430Cpu::fetch() {
  assert(getPc() % 2 == 0);
  uint16_t retval = read16(getPc());
  setPc(getPc() + 2);
  return retval;
}

uint16_t Msp430Cpu::read16(size_t addr) {
  uint8_t tmp[2];
  readMem(addr, tmp, 2);
  return Utility::ttohs(Utility::packBytes(tmp, 2));
}

uint8_t Msp430Cpu::read8(size_t addr) {
  uint8_t tmp;
  readMem(addr, &tmp, 1);
  return tmp;
}

void Msp430Cpu::write16(size_t addr, uint16_t val) {
  uint8_t tmp[2];
  Utility::unpackBytes(tmp, Utility::htots(val), 2);
  writeMem(addr, tmp, 2);
}

void Msp430Cpu::write8(size_t addr, uint8_t val) { writeMem(addr, &val, 1); }

void Msp430Cpu::writeback(operand_t operand) {
  writeback(operand.addr, operand.val, operand.inMem, operand.byteNotWord);
}

void Msp430Cpu::writeback(size_t addr, uint16_t val, bool toMemory,
                          bool byteNotWord) {
  if (toMemory) {
    if (byteNotWord) {
      write8(addr, static_cast<uint8_t>(val));
    } else {
      write16(addr, val);
    }
  } else {
    if (byteNotWord) {
      setGpr(addr, static_cast<uint8_t>(val));
    } else {
      setGpr(addr, val);
    }
  }
}

void Msp430Cpu::loadOperand(operand_t &operand) {
  if (operand.inMem) {
    if (operand.byteNotWord) {
      operand.val = read8(operand.addr);
    } else {
      operand.val = read16(operand.addr);
    }
  } else {
    if (operand.byteNotWord) {
      operand.val = static_cast<uint8_t>(getGpr(operand.addr));
    } else {
      operand.val = getGpr(operand.addr);
    }
  }
}

bool Msp430Cpu::isNegative(uint16_t val, bool byteNotWord) {
  if (byteNotWord) {
    return (val & (1u << 7));
  } else {
    return (val & (1u << 15));
  }
}

bool Msp430Cpu::isZero(uint16_t val, bool byteNotWord) {
  if (byteNotWord) {
    return static_cast<uint8_t>(val) == 0;
  } else {
    return static_cast<uint16_t>(val) == 0;
  }
}

Msp430Cpu::operand_t Msp430Cpu::getDestinationOperand(uint16_t opcode) {
  uint8_t destRegNum = opcode & 0x000f;
  bool ad = (opcode & (1u << 7));
  operand_t operand;
  std::memset(&operand, 0, sizeof(operand_t));
  operand.byteNotWord = (opcode & (1u << 6));
  if (ad) {
    if (destRegNum == CG_REGNUM) {
      // Invalid instruction
      spdlog::error(
          "getDestinationOperand:: Invalid destination register "
          "3(CG) in opcode 0x{:04x}",
          opcode);
      SC_REPORT_FATAL(this->name(), "Invalid destination register.");
    } else if (destRegNum == PC_REGNUM) {  // Symbolic
      operand.addr = getPc();              // Store old value of PC first
      operand.addr += fetch();             // Fetch offset (increments PC)
    } else if (destRegNum == SR_REGNUM) {  // Absolute
      operand.addr = fetch();              // Fetch absolute address
    } else {                               // Indexed
      operand.addr = getGpr(destRegNum);   // Get base address
      operand.addr += fetch();             // Fetch offset
    }
    operand.inMem = true;
  } else {  // Register direct
    operand.inMem = false;
    operand.addr = destRegNum;
  }

  operand.addr = static_cast<uint16_t>(operand.addr);  // Wrap to 16 bit
  if ((opcode & 0xf000) != OP_MOV) {  // Load value (if not MOV instruction)
    loadOperand(operand);
  }

  return operand;
}

bool Msp430Cpu::isSourceConstant(uint8_t as, uint8_t regIdx) {
  return ((regIdx == 3) || ((regIdx == 2) && (as >= 2)));
}

uint16_t Msp430Cpu::getSourceConstant(uint8_t as, uint8_t regIdx) {
  uint16_t result = 0;
  if (regIdx == CG_REGNUM) {
    if (as == 3) {
      result = static_cast<uint16_t>(-1u);
    } else {
      result = as;
    }
  } else if (regIdx == SR_REGNUM) {
    if (as == 2) {
      result = 4;
    } else if (as == 3) {
      result = 8;
    } else {
      spdlog::error(
          "getSourceConstant: invalid as 0x{:01x} for constant generator.", as);
      SC_REPORT_FATAL(this->name(),
                      "Invalid source address mode for constant generator");
    }
  }
  return result;
}

Msp430Cpu::operand_t Msp430Cpu::getSourceOperand(uint16_t opcode) {
  uint8_t as = (opcode & 0x0030) >> 4;  // address mode
  operand_t operand;
  std::memset(&operand, 0, sizeof(operand_t));
  operand.byteNotWord = (opcode & (1u << 6));

  uint8_t srcRegNum;
  if ((opcode & 0xf000) == 0x1000) {  // Single operand instruction
    srcRegNum = opcode & 0x000f;
  } else {  // Double operand instruction
    srcRegNum = (opcode & 0x0f00) >> 8;
  }

  // Special case -- constants
  if (isSourceConstant(as, srcRegNum)) {
    operand.inMem = false;
    operand.addr = srcRegNum;
    operand.val = getSourceConstant(as, srcRegNum);
    return operand;
  }

  // Register/memory access
  switch (as) {
    case 0:  // Register direct
      operand.inMem = false;
      operand.addr = srcRegNum;
      break;
    case 1:  // Indexed / Symbolic / Absolute
      operand.inMem = true;
      if (srcRegNum == PC_REGNUM) {         // Symbolic
        operand.addr = getPc();             // base address is PC
        operand.addr += fetch();            // fetch offset
      } else if (srcRegNum == SR_REGNUM) {  // Absolute
        operand.addr = fetch();             // Fetch absolute address
      } else {                              // Indexed
        operand.addr = getGpr(srcRegNum);   // Base addres
        operand.addr += fetch();            // Offset
      }
      break;
    case 2:  // Register indirect (@Rn)
      operand.inMem = true;
      operand.addr = getGpr(srcRegNum);
      break;
    case 3:  // Indirect autoincrement / immediate
      operand.inMem = true;
      if (srcRegNum == PC_REGNUM) {  // Immediate
        operand.addr = getPc();
        setPc(getPc() + 2);
      } else {  // Indirect autoincrement
        operand.addr = getGpr(srcRegNum);
        // Autoincrement
        if ((srcRegNum == SP_REGNUM) | (!operand.byteNotWord)) {
          setGpr(srcRegNum, getGpr(srcRegNum) + 2);
        } else {
          setGpr(srcRegNum, getGpr(srcRegNum) + 1);
        }
        break;
      }
  }

  operand.addr = static_cast<uint16_t>(operand.addr);  // Wrap to 16-bit
  loadOperand(operand);

  return operand;
}

void Msp430Cpu::executeConditionalJump(uint16_t opcode) {
  int32_t jumpOffset = opcode & 0x03ff;
  if (jumpOffset & (1u << 9)) {  // negative
    jumpOffset = jumpOffset - 0x03ff - 1;
  }
  jumpOffset *= 2;

  uint8_t condition = (opcode & 0x1C00) >> 10;
  bool doJump = false;
  switch (condition) {
    case 0:  // JNE / JNZ
      doJump = (getZeroFlag() == false);
      break;
    case 1:  // JEQ / JZ
      doJump = (getZeroFlag() == true);
      break;
    case 2:  // JNC / JLO
      doJump = (getCarryFlag() == false);
      break;
    case 3:  // JC  / JHS
      doJump = (getCarryFlag() == true);
      break;
    case 4:  // JN
      doJump = (getNegativeFlag() == true);
      break;
    case 5:  // JGE
      doJump = ((getNegativeFlag() ^ getOverflowFlag()) == false);
      break;
    case 6:  // JL
      doJump = ((getNegativeFlag() ^ getOverflowFlag()) == true);
      break;
    case 7:  // JMP
      doJump = true;
      break;
  }
  if (doJump) {
    setPc(getPc() + jumpOffset);
  }
  waitCycles(1);
}

void Msp430Cpu::executeSingleOpInstruction(uint16_t opcode) {
  unsigned instrIdx = (opcode & 0x0380) >> 7;
  operand_t operand = getSourceOperand(opcode);
  bool byteNotWord = operand.byteNotWord;
  uint32_t result;

  switch (instrIdx) {
    case 0:  // RRC Rotate right through carry
      result = operand.val >> 1;
      if (byteNotWord && getCarryFlag()) {
        result |= (1u << 7);
      } else if (getCarryFlag()) {
        result |= (1u << 15);
      }

      setCarryFlag(operand.val & 1u);
      setOverflowFlag(false);
      setNegativeFlag(isNegative(result, byteNotWord));
      setZeroFlag(isZero(result, byteNotWord));

      operand.val = result;
      writeback(operand);
      break;

    case 1:  // SWPB Swap bytes
      operand.val =
          ((operand.val & 0x00ff) << 8) | ((operand.val & 0xff00) >> 8);
      assert(operand.byteNotWord == false);
      writeback(operand);
      break;

    case 2:  // RRA Rotate right arithmetic
      if (operand.byteNotWord) {
        result = (operand.val & (1u << 7)) | (operand.val >> 1);
      } else {
        result = (operand.val & (1u << 15)) | (operand.val >> 1);
      }

      // Flags
      setCarryFlag(operand.val & 1u);
      setOverflowFlag(false);
      setNegativeFlag(isNegative(result, byteNotWord));
      setZeroFlag(isZero(result, byteNotWord));

      // Writeback
      operand.val = result;
      writeback(operand);
      break;

    case 3:  // SXT Sign extend
      if (operand.val & (1u << 7)) {
        operand.val |= 0xff00;  // Set upper byte
      } else {
        operand.val &= 0x00ff;  // Clear upper byte
      }

      // Flags
      setCarryFlag(!isZero(operand.val, false));
      setOverflowFlag(false);
      setNegativeFlag(isNegative(operand.val, false));
      setZeroFlag(isZero(operand.val, false));

      operand.byteNotWord = false;
      operand.addr &= ~(1u);  // Align to word
      writeback(operand);
      break;

