UoS-EEC/fused/mcu/msp430fr5xx/Msp430Cpu.cpp
    case 4:  // PUSH
      if (!operand.inMem) {
        // PUSH takes 3 cycles if operand is a register
        waitCycles(1);
      }
      setSp(getSp() - 2);
      operand.addr = getSp();
      operand.inMem = true;
      operand.byteNotWord = false;
      writeback(operand);
      break;

    case 5:  // CALL
      // Push PC
      setSp(getSp() - 2);
      writeback(getSp(), getPc(), /*toMemory=*/true, /*byteNotWord=*/false);

      // Jump
      setPc(operand.val);

      if (!operand.inMem) {
        // 4 cycles if operand is a register
        waitCycles(2);
      } else {
        // 4/5/6 cycles if operand is in memory
        waitCycles(1);
        // absolute mode requires one more cycle
        if ((opcode & 0x000f) == SR_REGNUM) {
          waitCycles(1);
        }
      }
      break;

    case 6:  // RETI Return from interrupt
      // Pop SR from stack
      setSr(read16(getSp()));
      setSp(getSp() + 2);

      // Pop PC from stack
      setPc(read16(getSp()));
      setSp(getSp() + 2);

      waitCycles(1);
      break;

    case 7:  // INVALID
      spdlog::error("executeSingleOpInstruction: Invalid opcode 0x{:04x}.",
                    opcode);
      SC_REPORT_FATAL(this->name(), "Invalid instruction");
  }
}

bool Msp430Cpu::isCarry(uint32_t a, uint32_t b, bool c, bool byteNotWord) {
  uint32_t res;
  if (byteNotWord) {
    res = (a & 0xff) + (b & 0xff) + c;
    return res > 0xff;
  } else {
    res = (a & 0xffff) + (b & 0xffff) + c;
    return res > 0xffff;
  }
}

bool Msp430Cpu::isOverflow(uint32_t a, uint32_t b, bool c, bool byteNotWord) {
  uint32_t res = a + b + c;
  bool aNeg = isNegative(a, byteNotWord);
  bool bNeg = isNegative(b, byteNotWord);
  bool resNeg = isNegative(res, byteNotWord);
  return (resNeg && (!aNeg) && (!bNeg)) | ((!resNeg) && aNeg && bNeg);
}

void Msp430Cpu::executeDoubleOpInstruction(uint16_t opcode) {
  unsigned instrIdx = (opcode & 0xf000) >> 12;
  operand_t srcOp = getSourceOperand(opcode);
  operand_t dstOp = getDestinationOperand(opcode);
  bool byteNotWord = srcOp.byteNotWord;
  uint32_t result;

  // Special case when PC is destination
  if (dstOp.addr == PC_REGNUM) {
    uint8_t as = (opcode & 0x0030) >> 4;
    uint8_t srcRegNum = (opcode & 0x0f00) >> 8;
    if ((as == 3) && (srcRegNum == PC_REGNUM)) {
      waitCycles(1);
    } else {
      waitCycles(2);
    }
  }

  switch (instrIdx) {
    case 4:  // MOV : dst = src
      dstOp.val = srcOp.val;
      writeback(dstOp);
      break;
    case 5:  // ADD : dst = src + dst
      result = srcOp.val + dstOp.val;

      setZeroFlag(isZero(result, dstOp.byteNotWord));
      setNegativeFlag(isNegative(result, dstOp.byteNotWord));
      setCarryFlag(isCarry(srcOp.val, dstOp.val, 0, byteNotWord));
      setOverflowFlag(isOverflow(srcOp.val, dstOp.val, 0, byteNotWord));

      dstOp.val = result;
      writeback(dstOp);
      break;
    case 6:  // ADDC : dst = src + dst + c
      result = srcOp.val + dstOp.val + getCarryFlag();

      setZeroFlag(isZero(result, dstOp.byteNotWord));
      setNegativeFlag(isNegative(result, dstOp.byteNotWord));
      setOverflowFlag(
          isOverflow(srcOp.val, dstOp.val, getCarryFlag(), byteNotWord));
      setCarryFlag(isCarry(srcOp.val, dstOp.val, getCarryFlag(), byteNotWord));
      dstOp.val = result;
      writeback(dstOp);
      break;
    case 7:  // SUBC : dst = dst + ~src + c
      result = (~srcOp.val) + getCarryFlag() + dstOp.val;

      setZeroFlag(isZero(result, byteNotWord));
      setNegativeFlag(isNegative(result, byteNotWord));
      setOverflowFlag(
          isOverflow(dstOp.val, ~srcOp.val, getCarryFlag(), byteNotWord));
      setCarryFlag(isCarry(dstOp.val, ~srcOp.val, getCarryFlag(), byteNotWord));

      dstOp.val = result;
      writeback(dstOp);
      break;
    case 8:  // SUB : dst = dst + ~src + 1
      result = (~srcOp.val) + dstOp.val + 1;

      setZeroFlag(isZero(result, byteNotWord));
      setNegativeFlag(isNegative(result, byteNotWord));
      setOverflowFlag(isOverflow(dstOp.val, ~srcOp.val, 1, byteNotWord));
      setCarryFlag(isCarry(dstOp.val, ~srcOp.val, 1, byteNotWord));

      dstOp.val = result;
      writeback(dstOp);
      break;
    case 9:  // CMP
      result = (~srcOp.val) + dstOp.val + 1;

      setZeroFlag(isZero(result, byteNotWord));
      setNegativeFlag(isNegative(result, byteNotWord));
      setOverflowFlag(isOverflow(dstOp.val, ~srcOp.val, 1, byteNotWord));
      setCarryFlag(isCarry(dstOp.val, ~srcOp.val, 1, byteNotWord));
      break;
    case 10:  // DADD
      SC_REPORT_FATAL(this->name(), "DADD instruction is not implemented.");
      break;
    case 11:  // BIT
      result = srcOp.val & dstOp.val;

      setZeroFlag(isZero(result, byteNotWord));
      setNegativeFlag(isNegative(result, byteNotWord));
      setOverflowFlag(false);
      setCarryFlag(!getZeroFlag());
      break;
    case 12:  // BIC : dst &= ~src
      dstOp.val &= ~srcOp.val;
      writeback(dstOp);
      break;
    case 13:  // BIS : dst |= src (logical OR)
      dstOp.val |= srcOp.val;
      writeback(dstOp);
      break;
    case 14:  // XOR : dst ^= src
      result = dstOp.val ^ srcOp.val;

      setZeroFlag(isZero(result, byteNotWord));
      setNegativeFlag(isNegative(result, byteNotWord));
      setOverflowFlag(isNegative(srcOp.val, byteNotWord) &&
                      isNegative(dstOp.val, byteNotWord));
      setCarryFlag(!getZeroFlag());

      dstOp.val = result;
      writeback(dstOp);
      break;
    case 15:  // AND : dst &= src
      result = dstOp.val & srcOp.val;

      setZeroFlag(isZero(result, byteNotWord));
      setNegativeFlag(isNegative(result, byteNotWord));
      setOverflowFlag(false);
      setCarryFlag(!isZero(result, byteNotWord));

      dstOp.val = result;
      writeback(dstOp);
      break;
  }
}

void Msp430Cpu::waitForCommand() {
  while (isStalled()) {
    std::this_thread::sleep_for(std::chrono::milliseconds(1));
  }
}

std::ostream &operator<<(std::ostream &os, const Msp430Cpu &rhs) {
  std::array<const std::string, 16> registernames = {
      {"r0 (pc)", "r1 (sp)", "r2 (sr)", "r3 (cg)", "r4", "r5", "r6", "r7", "r8",
       "r9", "r10", "r11", "r12", "r13", "r14", "r15"}};
  // clang-format off
  os << "<Msp430Cpu> " << rhs.name()
    << "\nm_run (active) " << rhs.m_run
    << "\nm_sleeping " << rhs.m_sleeping
    << "\nclock period " << rhs.mclk->getPeriod()
    << "\nirq " << rhs.irq.read()
    << "\nira " << rhs.ira.read()
    << "\nirqIdx " << rhs.irqIdx.read()
    << "\nbusStall " << rhs.busStall.read()
    << "\ncpu registers:";
  for (int i = 0; i < rhs.m_cpuRegs.size(); ++i) {
    os << fmt::format("\n\t{:s}: 0x{:04x}", registernames[i], rhs.m_cpuRegs[i]);
  }

  os << "\nBreakpoints:";
  for (const auto &b : rhs.m_breakpoints) {
    os << fmt::format("\n\t0x{:04x}", b);
  }
  os << "\n";
  // clang-format on
  return os;
}
